<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4b3e6ad18e102890226d2d23f085b9c7ef900539670d69ce2c229e6d8d1e44fc","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1140 at https://github.com/cal-itp/data-infra/actions/runs/19977841888","plan_out_hash":"055d418ccf26411ef514e4d2d921aa478192b7ac5cfcfd4b293a4827fab9d394","plan_hash":"ad9f6d119301b6e21aabbe1085c4051dcc054e503c2ce46d073acde6bbdc9f6a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "jEUqnA==" -> (known after apply)
!~      detect_md5hash      = "ZYTkUmeUMtIvs1blYkKWpw==" -> "different hash"
!~      generation          = 1764958876400985 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "ZYTkUmeUMtIvs1blYkKWpw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "PDdTLA==" -> (known after apply)
!~      detect_md5hash      = "daih3OC0YlIxraoHhCaV1g==" -> "different hash"
!~      generation          = 1764958877888377 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "daih3OC0YlIxraoHhCaV1g==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1140](https://github.com/cal-itp/data-infra/actions/runs/19977841888)